In [3]:
import pandas as pd

In [34]:
df = pd.read_csv('crop_yield.csv')

In [35]:
df.head(5)

,Crop,Crop_Year,Season,State,Area,Production,Annual_Rainfall,Fertilizer,Pesticide,Yield
0,Arecanut,1997,Whole Year,Assam,73814.0,56708,2051.4,7024878.38,22882.34,0.796087
1,Arhar/Tur,1997,Kharif,Assam,6637.0,4685,2051.4,631643.29,2057.47,0.710435
2,Castor seed,1997,Kharif,Assam,796.0,22,2051.4,75755.32,246.76,0.238333
3,Coconut,1997,Whole Year,Assam,19656.0,126905000,2051.4,1870661.52,6093.36,5238.051739
4,Cotton(lint),1997,Kharif,Assam,1739.0,794,2051.4,165500.63,539.09,0.420909

In [36]:
df.tail(2)

,Crop,Crop_Year,Season,State,Area,Production,Annual_Rainfall,Fertilizer,Pesticide,Yield
19687,Rice,1997,Kharif,Jammu and Kashmir,275746.0,5488,1356.2,26242746.82,85481.26,0.016667
19688,Wheat,1997,Rabi,Jammu and Kashmir,239344.0,392160,1356.2,22778368.48,74196.64,1.261818

In [37]:
df

,Crop,Crop_Year,Season,State,Area,Production,Annual_Rainfall,Fertilizer,Pesticide,Yield
0,Arecanut,1997,Whole Year,Assam,73814.0,56708,2051.4,7024878.38,22882.34,0.796087
1,Arhar/Tur,1997,Kharif,Assam,6637.0,4685,2051.4,631643.29,2057.47,0.710435
2,Castor seed,1997,Kharif,Assam,796.0,22,2051.4,75755.32,246.76,0.238333
3,Coconut,1997,Whole Year,Assam,19656.0,126905000,2051.4,1870661.52,6093.36,5238.051739
4,Cotton(lint),1997,Kharif,Assam,1739.0,794,2051.4,165500.63,539.09,0.420909
...,...,...,...,...,...,...,...,...,...,...
19684,Small millets,1998,Kharif,Nagaland,4000.0,2000,1498.0,395200.00,1160.00,0.500000
19685,Wheat,1998,Rabi,Nagaland,1000.0,3000,1498.0,98800.00,290.00,3.000000
19686,Maize,1997,Kharif,Jammu and Kashmir,310883.0,440900,1356.2,29586735.11,96373.73,1.285000
19687,Rice,1997,Kharif,Jammu and Kashmir,275746.0,5488,1356.2,26242746.82,85481.26,0.016667
19688,Wheat,1997,Rabi,Jammu and Kashmir,239344.0,392160,1356.2,22778368.48,74196.64,1.261818

In [38]:
df.describe()

,Crop_Year,Area,Production,Annual_Rainfall,Fertilizer,Pesticide,Yield
count,19689.000000,1.968900e+04,1.968900e+04,19689.000000,1.968900e+04,1.968900e+04,19689.000000
mean,2009.127584,1.799266e+05,1.643594e+07,1437.755177,2.410331e+07,4.884835e+04,79.954009
std,6.498099,7.328287e+05,2.630568e+08,816.909589,9.494600e+07,2.132874e+05,878.306193
min,1997.000000,5.000000e-01,0.000000e+00,301.300000,5.417000e+01,9.000000e-02,0.000000
25%,2004.000000,1.390000e+03,1.393000e+03,940.700000,1.880146e+05,3.567000e+02,0.600000
50%,2010.000000,9.317000e+03,1.380400e+04,1247.600000,1.234957e+06,2.421900e+03,1.030000
75%,2015.000000,7.511200e+04,1.227180e+05,1643.700000,1.000385e+07,2.004170e+04,2.388889
max,2020.000000,5.080810e+07,6.326000e+09,6552.700000,4.835407e+09,1.575051e+07,21105.000000

In [39]:
df.dtypes

Crop                object
Crop_Year            int64
Season              object
State               object
Area               float64
Production           int64
Annual_Rainfall    float64
Fertilizer         float64
Pesticide          float64
Yield              float64
dtype: object

In [40]:
##handling missing values
df.isnull()

,Crop,Crop_Year,Season,State,Area,Production,Annual_Rainfall,Fertilizer,Pesticide,Yield
0,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...
19684,False,False,False,False,False,False,False,False,False,False
19685,False,False,False,False,False,False,False,False,False,False
19686,False,False,False,False,False,False,False,False,False,False
19687,False,False,False,False,False,False,False,False,False,False
19688,False,False,False,False,False,False,False,False,False,False

In [41]:
df.isnull().any()

Crop               False
Crop_Year          False
Season             False
State              False
Area               False
Production         False
Annual_Rainfall    False
Fertilizer         False
Pesticide          False
Yield              False
dtype: bool

In [42]:
df.isnull().any(axis = 1)

0        False
1        False
2        False
3        False
4        False
         ...
19684    False
19685    False
19686    False
19687    False
19688    False
Length: 19689, dtype: bool

In [43]:
df.isnull().sum()

Crop               0
Crop_Year          0
Season             0
State              0
Area               0
Production         0
Annual_Rainfall    0
Fertilizer         0
Pesticide          0
Yield              0
dtype: int64

In [44]:
df.fillna(0)

,Crop,Crop_Year,Season,State,Area,Production,Annual_Rainfall,Fertilizer,Pesticide,Yield
0,Arecanut,1997,Whole Year,Assam,73814.0,56708,2051.4,7024878.38,22882.34,0.796087
1,Arhar/Tur,1997,Kharif,Assam,6637.0,4685,2051.4,631643.29,2057.47,0.710435
2,Castor seed,1997,Kharif,Assam,796.0,22,2051.4,75755.32,246.76,0.238333
3,Coconut,1997,Whole Year,Assam,19656.0,126905000,2051.4,1870661.52,6093.36,5238.051739
4,Cotton(lint),1997,Kharif,Assam,1739.0,794,2051.4,165500.63,539.09,0.420909
...,...,...,...,...,...,...,...,...,...,...
19684,Small millets,1998,Kharif,Nagaland,4000.0,2000,1498.0,395200.00,1160.00,0.500000
19685,Wheat,1998,Rabi,Nagaland,1000.0,3000,1498.0,98800.00,290.00,3.000000
19686,Maize,1997,Kharif,Jammu and Kashmir,310883.0,440900,1356.2,29586735.11,96373.73,1.285000
19687,Rice,1997,Kharif,Jammu and Kashmir,275746.0,5488,1356.2,26242746.82,85481.26,0.016667
19688,Wheat,1997,Rabi,Jammu and Kashmir,239344.0,392160,1356.2,22778368.48,74196.64,1.261818

In [51]:
##filling missing values with mean

df['Crop_Year_filNa'] = df['Crop_Year'].fillna(df['Crop_Year'].mean())
df

,Phasal,Crop_Year,Season,State,Area,Production,Annual_Rainfall,Fertilizer,Pesticide,Yield,Crop_Year_filNa,jaga,new_year
0,Arecanut,1997,Whole Year,Assam,73814.0,56708,2051.4,7024878.38,22882.34,0.796087,1997,73814,147628.0
1,Arhar/Tur,1997,Kharif,Assam,6637.0,4685,2051.4,631643.29,2057.47,0.710435,1997,6637,13274.0
2,Castor seed,1997,Kharif,Assam,796.0,22,2051.4,75755.32,246.76,0.238333,1997,796,1592.0
3,Coconut,1997,Whole Year,Assam,19656.0,126905000,2051.4,1870661.52,6093.36,5238.051739,1997,19656,39312.0
4,Cotton(lint),1997,Kharif,Assam,1739.0,794,2051.4,165500.63,539.09,0.420909,1997,1739,3478.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
19684,Small millets,1998,Kharif,Nagaland,4000.0,2000,1498.0,395200.00,1160.00,0.500000,1998,4000,8000.0
19685,Wheat,1998,Rabi,Nagaland,1000.0,3000,1498.0,98800.00,290.00,3.000000,1998,1000,2000.0
19686,Maize,1997,Kharif,Jammu and Kashmir,310883.0,440900,1356.2,29586735.11,96373.73,1.285000,1997,310883,621766.0
19687,Rice,1997,Kharif,Jammu and Kashmir,275746.0,5488,1356.2,26242746.82,85481.26,0.016667,1997,275746,551492.0
19688,Wheat,1997,Rabi,Jammu and Kashmir,239344.0,392160,1356.2,22778368.48,74196.64,1.261818,1997,239344,478688.0

In [52]:
## rename the columns
df = df.rename(columns={'Crop': 'Phasal'})
df.head(1)

,Phasal,Crop_Year,Season,State,Area,Production,Annual_Rainfall,Fertilizer,Pesticide,Yield,Crop_Year_filNa,jaga,new_year
0,Arecanut,1997,Whole Year,Assam,73814.0,56708,2051.4,7024878.38,22882.34,0.796087,1997,73814,147628.0

In [53]:
## change datatypes
df['jaga']=df['Area'].astype(int)
df.head(1)

,Phasal,Crop_Year,Season,State,Area,Production,Annual_Rainfall,Fertilizer,Pesticide,Yield,Crop_Year_filNa,jaga,new_year
0,Arecanut,1997,Whole Year,Assam,73814.0,56708,2051.4,7024878.38,22882.34,0.796087,1997,73814,147628.0

In [54]:
df['new_year']=df['Area'].apply(lambda x:x*2)
df.head(2)

,Phasal,Crop_Year,Season,State,Area,Production,Annual_Rainfall,Fertilizer,Pesticide,Yield,Crop_Year_filNa,jaga,new_year
0,Arecanut,1997,Whole Year,Assam,73814.0,56708,2051.4,7024878.38,22882.34,0.796087,1997,73814,147628.0
1,Arhar/Tur,1997,Kharif,Assam,6637.0,4685,2051.4,631643.29,2057.47,0.710435,1997,6637,13274.0

In [57]:
grouped_mean=df.groupby('Crop_Year')['Yield'].mean()
print(grouped_mean)

Crop_Year
1997     63.872577
1998     55.938462
1999     76.943722
2000     75.572901
2001     75.441594
2002     80.656215
2003     83.694593
2004     81.201928
2005     86.486543
2006     77.479036
2007     76.749776
2008     85.636898
2009     85.949719
2010     72.177623
2011     84.045009
2012     76.564190
2013     94.867996
2014    107.150319
2015     82.242225
2016     78.050312
2017     74.749449
2018     75.253703
2019     74.319618
2020      4.420096
Name: Yield, dtype: float64

In [61]:
df.groupby('Phasal')['Yield'].mean()

Phasal
Arecanut                    2.073635
Arhar/Tur                   0.967348
Bajra                       2.427462
Banana                     26.851128
Barley                      1.595540
Black pepper                0.829605
Cardamom                    0.168355
Cashewnut                   3.120438
Castor seed                 0.693609
Coconut                  8652.000199
Coriander                   0.648200
Cotton(lint)                1.797044
Cowpea(Lobia)               0.813224
Dry chillies                2.078330
Garlic                      4.544886
Ginger                      6.442202
Gram                        0.876469
Groundnut                   1.360983
Guar seed                   0.951875
Horse-gram                  0.462822
Jowar                       1.072498
Jute                        7.555393
Khesari                     0.788941
Linseed                     0.473930
Maize                       3.427216
Masoor                      0.703153
Mesta                       5.389204
Moong(Green Gram)           0.530940
Moth                        0.445995
Niger seed                  0.423523
Oilseeds total              1.995559
Onion                      13.247525
Other  Rabi pulses          0.780380
Other Cereals               0.849546
Other Kharif pulses         0.699513
Other Summer Pulses         0.859925
Peas & beans (Pulses)       1.393895
Potato                     13.331718
Ragi                        1.215408
Rapeseed &Mustard           0.791568
Rice                        2.218495
Safflower                   0.565482
Sannhamp                    1.274959
Sesamum                     0.611750
Small millets               0.768722
Soyabean                    1.083194
Sugarcane                  51.727439
Sunflower                   0.934086
Sweet potato                9.240788
Tapioca                    16.667301
Tobacco                     2.110708
Turmeric                    3.325392
Urad                        0.584048
Wheat                       2.005086
other oilseeds              1.789220
Name: Yield, dtype: float64

In [64]:
df.groupby(['Phasal', 'Crop_Year'])['Yield'].sum()

Phasal          Crop_Year
Arecanut        1997          6.174995
                1998         12.121166
                1999          7.896633
                2000         12.434177
                2001         11.477988
                               ...
other oilseeds  2016          6.697667
                2017         24.958333
                2018         25.245631
                2019         27.596665
                2020          1.390000
Name: Yield, Length: 1260, dtype: float64

In [68]:
##aggregate multiple functions
grouped_agg = df.groupby('Phasal')['Yield'].agg(['mean','sum','count'])
grouped_agg.head(3)

               mean          sum  count
Phasal
Arecanut   2.073635   335.928941    162
Arhar/Tur  0.967348   491.412661    508
Bajra      2.427462  1271.990091    524

In [69]:
##merging and joining datafra
df1 = pd.DataFrame({'key': ['A', 'B', 'C'], 'value1': [1, 2, 3]})
df2 = pd.DataFrame({'key': ['A', 'B', 'D'], 'value2': [4, 5, 6]})
df1

  key  value1
0   A       1
1   B       2
2   C       3

In [70]:
df2

  key  value2
0   A       4
1   B       5
2   D       6

In [72]:
merged_inner = pd.merge(df1, df2, on='key', how='inner')
merged_inner

  key  value1  value2
0   A       1       4
1   B       2       5

In [73]:
merged_outer = pd.merge(df1, df2, on='key', how='outer')
merged_outer

  key  value1  value2
0   A     1.0     4.0
1   B     2.0     5.0
2   C     3.0     NaN
3   D     NaN     6.0

In [74]:
merged_left = pd.merge(df1, df2, on='key', how='left')
merged_left

  key  value1  value2
0   A       1     4.0
1   B       2     5.0
2   C       3     NaN

In [75]:
merged_right = pd.merge(df1, df2, on='key', how='right')
merged_right

  key  value1  value2
0   A     1.0       4
1   B     2.0       5
2   D     NaN       6